#include "common.h"
#include "module.h"


void overflow_box(int x,int y)//当malloc分配空间失败时提示，回车退出系统
{

	bar(x-350,y-100,x+350,y-70,255);
	bar(x-350,y-70,x+350,y+100,46651);
	bar_round(x+335,y-85,28,28,2,1,63488);

	fdhz(x-75,y+10,2,2,"内",0);
	fdhz(x-30,y+10,2,2,"存",0);
	fdhz(x+15,y+10,2,2,"溢",0);
	fdhz(x+60,y+10,2,2,"出",0);

	fdhz(x-75,y+53,2,2,"回",0);
	fdhz(x-45,y+53,2,2,"车",0);
	fdhz(x,y+53,2,2,"以",0);
	fdhz(x+45,y+53,2,2,"退",0);
	fdhz(x+75,y+53,2,2,"出",0);
}

void null_box(int x,int y)//当找不到相应文件路径时显示，回车退出系统
{
	bar(x-350,y-100,x+350,y-70,255);
	bar(x-350,y-70,x+350,y+100,46651);
	bar_round(x+335,y-85,28,28,2,1,63488);

	fdhz(x-115,y-20,2,2,"找",0);
	fdhz(x-75,y-20,2,2,"不",0);
	fdhz(x-30,y-20,2,2,"到",0);
	fdhz(x+15,y-20,2,2,"该",0);
	fdhz(x+60,y-20,2,2,"路",0);
	fdhz(x+100,y-20,2,2,"径",0);
	

	fdhz(x-75,y+23,2,2,"回",0);
	fdhz(x-45,y+23,2,2,"车",0);
	fdhz(x,y+23,2,2,"以",0);
	fdhz(x+45,y+23,2,2,"退",0);
	fdhz(x+75,y+23,2,2,"出",0);
}